blog/2015/07/10/a-garbage-collector-for-c-and-cpp/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>一个C/CPP垃圾回收器 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="C/CPP自动垃圾回收器" />
  <meta name="keywords" content="c, garbage" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>一个C/CPP垃圾回收器</h1>
  
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">简介</h2>
<div class="outline-text-2" id="text-1">
<p>
保守的垃圾加收器可以规代C语言的```malloc```和C++的```new```。它让你像往常一样申请内存，但是不需要手动释放它。当回收器检测到某些内存不需要被访问时，会自动回收它们。一个简单的示例如下：
</p>

<div class="org-src-container">

<pre class="src src-VB">Dim num1, num2 As Integer
Dim text As String
</pre>
</div>

<p>
这是静态语言的变量定义原型。当变量首次声明的时候，必须指定它的类型。与之不同的是，动态语言则不需要，下面是一段ECMA脚本：
</p>

<div class="org-src-container">

<pre class="src src-ECMA">var num1, num2;
var text;
</pre>
</div>

<p>
在这个示例中，没有为这些变量指定任何类型。 你可以赋予变量 <i>num1</i> 任何类型的值。不仅如此，变量声明过程完全是没有必要的。类型信息存储在值对象中。
</p>

<p>
除Javascript之外，还有很多流行的动态语言，如：Python, Ruby, Lua, Scheme, Lisp等。除了语法风格和表达角度不一样，其他都非常类似，如一致的类型系统。所以动态类型语言还常常被理解成鸭子类型或鸭子语言。
</p>

<p>
我们在从头开始设计鸭子语言的时候，会遵循这些共同特性，并且从最基础部分开始构建一门语言只是一个锻炼。在探索的过程中将不考虑实用性和可行性。当我们完成这一过程之后再来考虑这些想法。
</p>

<p>
在开始之前，我要友好地提醒一下各位读者：接下来的章节可能会包含一些非常复杂的知识，即使我已经尽我所能使用朴素和简单的语言来陈述他们。我建议大家在开始此次『语言设计之旅』之前做一些编程语言设计的调研。那么，咱们开始吧！
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">语法</h2>
<div class="outline-text-2" id="text-2">
<p>
现在应该很容易就能找到一份关于句法表达式、新手指南、Wiki或者某语言的语法指导的完整文档。先暂时放下这些，继续做更有效的任务。
</p>
</div>
</div>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
